{
  "title": "Projects",
  "projects": [
    {
      "title": "Piper",
      "description": "Game in which you must move titles to connect pipes before time runs out. Inspired by nostalgia for [Pipe Mania](https://en.wikipedia.org/wiki/Pipe_Mania).\n\nFinal JavaScript project at App Academy. \n\n\n\n\n\n[Live](http://www.derekshiller.com/piper/piper.php)  [Github](https://github.com/dcshiller/piper)",
      "image": "/static/assets/images/Piper.png",
      "tags": [
        "games/sims",
        "programming"
      ]
    },
    {
      "title": "Turing Machine Simulator",
      "description": "Written in ruby, this program allows the user to create and run Turing machine programs from the terminal. This little program can solve any problem! \n\nThis was developed as an experiment for what could be done in a terminal. \n\n[Github](http://www.github.com/dshiller/turingmachine)",
      "image": "/static/assets/images/TuringMachineSimulator.png",
      "tags": [
        "games/sims",
        "programming"
      ]
    },
    {
      "title": "Neural Network Project",
      "description": "This program is a vanilla JavaScript tool for building neural networks that can be hooked up to control the movements of a simple artificial creature. Inspired by the ediacaran trace fossils.\n\nNetworks are drawn on an html canvas that accommodates zooming and scrolling and are controlled with an mvc code architecture.\n\n[Live](http://www.derekshiller.com/nnp/nnp.html)  [Github](http://github.com/dcshiller/nnp)",
      "image": "/static/assets/images/nnp.png",
      "tags": [
        "games/sims",
        "programming",
        "mind",
        "ai"
      ]
    },
    {
      "title": "Where Do They Publish?",
      "description": "A tool written as an experiment with Go. This program queries for articles by author and compiles them, listing where the given authors publish. The data is very incomplete.\n\n[live](http://wheredotheypublish.derekshiller.com)",
      "image": "/static/assets/images/WDTP.png",
      "tags": [
        "philosophy",
        "academia"
      ]
    },
    {
      "title": "Philosophy Data Project",
      "description": "A web database for storing philosophy data in a way that is easy to access. Written in Rails.\n\n[Github](http://github.com/dcshiller/philosophydataproject)",
      "image": "/static/assets/images/pdp.png",
      "tags": [
        "philosophy",
        "academia"
      ]
    },
    {
      "title": "ForMu",
      "description": "Final project at App Academy. React + Rails project for making and sharing forms. Modeled on WuFoo.\n\n[Live](http://formu.derekshiller.com/) [Github](http://github.com/dcshiller/formu)",
      "image": "/static/assets/images/ForMu.png",
      "tags": [
        "programming"
      ]
    },
    {
      "title": "A Primitive Solution to the Negation Problem",
      "description": "A response to Unwin and Schroeder's Negation Problem. I make the case that metaethical expressivists should be unbothered by a large number of brute norms, and hence that they should be free to postulate their way out of the negation problem.",
      "image": "",
      "tags": [
        "philosophy",
        "ethics",
        "metaethics",
        "papers"
      ]
    },
    {
      "title": "The Unity of Moral Attitudes",
      "description": "",
      "image": "",
      "tags": [
        "philosophy",
        "metaethics",
        "mind",
        "papers"
      ],
      "file": "/assets/recipesemanticsfinal.doc"
    },
    {
      "title": "In Defense of Artificial Replacement",
      "description": "If it is within our power to provide a significantly better world for future generations at a comparatively small cost to ourselves, we have a strong moral reason to do so. One way of providing a significantly better world may involve replacing our species with something better. It is plausible that in the not-too-distant future, we will be able to create artificially intelligent creatures with whatever physical and psychological traits we choose. Granted this assumption, it is argued that we should engineer our extinction so that our planet's resources can be devoted to making artificial creatures with better lives.",
      "image": "",
      "tags": [
        "philosophy",
        "ethics",
        "ai",
        "papers"
      ],
      "file": "/assets/shiller.indefenseofartificialreplacement.pdf"
    },
    {
      "title": "Hidden Qualia",
      "description": "In this paper, I propose that those who reject higher-order theories of consciousness should not rule out the possibility of having conscious experiences that they cannot introspect.",
      "image": "",
      "tags": [
        "philosophy",
        "mind",
        "papers"
      ],
      "file": "/assets/derekshiller.hiddenqualia.pdf"
    },
    {
      "title": "The Problem of Other Attitudes",
      "description": "This paper presents a related problem concerning how noncognitivists might extend their accounts of moral judgments to other kinds of moral attitudes, such as moral hopes and moral intuitions. After presenting the problem, several contemporary theories with some initial promise for solving it are examined and found to be insufficient.",
      "image": "",
      "tags": [
        "philosophy",
        "metaethics",
        "mind",
        "papers"
      ],
      "file": "/assets/derekshiller.aprimitivesolutiontothenegationproblem.pdf"
    }
  ]
}