{
  "title": "Projects",
  "projects": [
    {
      "title": "Piper",
      "description": "Game in which you must move titles to connect pipes before time runs out. Inspired by nostalgia for [Pipe Mania](https://en.wikipedia.org/wiki/Pipe_Mania).\n\nFinal JavaScript project at App Academy. \n\n\n\n\n\n[Live](http://www.derekshiller.com/piper/piper.php)  [Github](https://github.com/dcshiller/piper)",
      "image": "/static/assets/images/Piper.png",
      "tags": [
        "games and sims",
        "programming"
      ]
    },
    {
      "title": "Turing Machine Simulator",
      "description": "A program for creating and running Turing machine programs. This is an experiment for what can be done inside a terminal.\n\n\n\n\n\n\n\n[Github](Github)",
      "image": "/static/assets/images/TuringMachineSimulator.png",
      "tags": [
        "games and sims",
        "programming"
      ]
    },
    {
      "title": "Neural Network Project",
      "description": "A JavaScript tool for building neural networks. \n\nThe networks can be hooked up to control the movements of an artificial creature.\n\n\n\n\n\n[Live](http://www.derekshiller.com/nnp/nnp.html)  [Github](http://github.com/dcshiller/nnp)",
      "image": "/static/assets/images/nnp.png",
      "tags": [
        "games and sims",
        "programming",
        "mind",
        "ai"
      ]
    },
    {
      "title": "Where Do They Publish?",
      "description": "Piper Desc,",
      "image": "/static/assets/images/WDTP.png",
      "tags": [
        "philosophy",
        "academia"
      ]
    },
    {
      "title": "Philosophy Data Project",
      "description": "Web database for philosophy data\n\n\n\nWritten in Rails\n\n[Github](http://github.com/dcshiller/philosophydataproject)",
      "image": "/static/assets/images/pdp.png",
      "tags": [
        "philosophy",
        "academia"
      ]
    },
    {
      "title": "ForMu",
      "description": "Final project at App Academy.\n\n\n\n[Live](http://formu.derekshiller.com/) [Github](http://github.com/dcshiller/formu)",
      "image": "/static/assets/images/ForMu.png",
      "tags": [
        "programming"
      ]
    },
    {
      "title": "A Primitive Solution to the Negation Problem",
      "description": "A response to Unwin and Schroeder's Negation Problem. I make the case that metaethical expressivists should be unbothered by a large number of brute norms, and hence that they should be free to postulate their way out of the negation problem.",
      "image": "",
      "tags": [
        "philosophy",
        "ethics",
        "metaethics"
      ]
    },
    {
      "title": "The Unity of Moral Attitudes",
      "description": "Noncognitivists are known to face a problem in extending their account of straightforward predicative moral judgments to logically complex moral judgments. This paper presents a related problem concerning how noncognitivists might extend their accounts of moral judgments to other kinds of moral attitudes, such as moral hopes and moral intuitions. Noncognitivists must solve three separate challenges: they must explain the natures of these other attitudes, they must explain why they count as moral attitudes, and they must explain why the moral attitudes are systematically correlated with ordinary propositional attitudes. After presenting the problem, several contemporary theories with some initial promise for solving it are examined and found to be insufficient.",
      "image": "",
      "tags": [
        "philosophy",
        "metaethics",
        "mind"
      ]
    },
    {
      "title": "In Defense of Artificial Replacement",
      "description": "If it is within our power to provide a significantly better world for future generations at a comparatively small cost to ourselves, we have a strong moral reason to do so. One way of providing a significantly better world may involve replacing our species with something better. It is plausible that in the not-too-distant future, we will be able to create artificially intelligent creatures with whatever physical and psychological traits we choose. Granted this assumption, it is argued that we should engineer our extinction so that our planet's resources can be devoted to making artificial creatures with better lives.",
      "image": "",
      "tags": [
        "philosophy",
        "ethics",
        "ai"
      ]
    },
    {
      "title": "Hidden Qualia",
      "description": "In this paper, I propose that those who reject higher-order theories of consciousness should not rule out the possibility of having conscious experiences that they cannot introspect. I begin by offering four arguments that such non-introspectible conscious experiences are possible. Next, I offer two arguments for thinking that we actually have such experiences. According to the first argument  it is unlikely that evolution would have furnished us with a faculty of introspection that worked flawlessly. According to the second argument, there are many plausible potential sources of non-introspectible experiences. Given that all of these sources are at least somewhat plausible, it is fairly probable that we have some kind or other. Finally, I consider whether we might be justified in believing that we can introspect all of our conscious experiences if in fact we can. I show that current approaches to justifying belief in epiphenomenal qualia do not carry over. The upshot of these arguments is that we should be less certain that we really know what it feels like to be us. There may be much more to our experiences than we are aware of.",
      "image": "/assets/page.png",
      "tags": [
        "philosophy",
        "mind"
      ]
    },
    {
      "title": "The Problem of Other Attitudes",
      "image": "",
      "description": "Noncognitivists are known to face a problem in extending their account of straightforward predicative moral judgments to logically complex moral judgments. This paper presents a related problem concerning how noncognitivists might extend their accounts of moral judgments to other kinds of moral attitudes, such as moral hopes and moral intuitions. Noncognitivists must solve three separate challenges: they must explain the natures of these other attitudes, they must explain why they count as moral attitudes, and they must explain why the moral attitudes are systematically correlated with ordinary propositional attitudes. After presenting the problem, the paper examines several contemporary theories with some initial promise for solving it and argues that they are insufficient.",
      "tags": [
        "philosophy",
        "metaethics",
        "mind"
      ]
    }
  ]
}
